ERP/src/InformationRegisters/СтавкиПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтавкиПартнеров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Процент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартнерскаяКомпания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/СтавкиПартнеров/Ext/ManagerModule.bsl
Функция ПолучитьСтавку(Партнер, Компания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтавкиПартнеров.Ставка КАК Ставка
		|ИЗ
		|	РегистрСведений.СтавкиПартнеров КАК СтавкиПартнеров
		|ГДЕ
		|	СтавкиПартнеров.Партнер = &Партнер
		|	И СтавкиПартнеров.Компания = &Компания";
	
	Запрос.УстановитьПараметр("Компания", Компания);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Ставка;
	
КонецФункции
